app/views/projects/show.html.erb

SELECT COUNT(*) FROM "pledges" WHERE "pledges"."project_id" = ?  [["project_id", 1]]
---

  <%= link_to pluralize(@project.pledges.size, "pledge"),
            project_pledges_path(@project) %>