app/controllers/pledges_controller.rb

  def create
    @pledge = @project.pledges.new(review_params)
    if @pledge.save
---
INSERT INTO "pledges" ("comment", "created_at", "email", "name", "pledge_amount", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)